Revit 2027 API
Rebar.GetLayoutFormula Method
 Gets the formula that is used to compute the spacings between bars.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string GetLayoutFormula(
	bool formatFormula
)
Public Function GetLayoutFormula (
	formatFormula As Boolean
) As String
public:
String^ GetLayoutFormula(
	bool formatFormula
)
member GetLayoutFormula :
        formatFormula : bool -> string
Parameters
formatFormula Boolean
 If it's false the returned string will contain values that are not rounded and they are in internal Revit units (decimal feet), otherwise it will be formatted according to project units.
Return Value
String
 Returns the formula that is used to compute the spacings between bars.
Exceptions
Exception | Condition
InvalidOperationException |  Rebar should have CustomSpacing layout.
See Also
Reference
Rebar Class
Autodesk.Revit.DB.Structure Namespace